In [8]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

Creating a data frame using dictionary

In [25]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,25,25]
}

converting the above dictionary as data frame

In [26]:
data = pd.DataFrame(data)

In [27]:
data

    fruit  Cost
0   Apple    20
1  Orange    30
2  Banana    10
3   Mango    25
4  Grapes    25

first coloumn is called the index column and the next columns correspond the number of columns in the dictonary

where the index column is by default

In [43]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,25,25]
}

In [44]:
data = pd.DataFrame(data,index=['fruit1','fruit2','fruit3','fruit4','fruit5'])

In [45]:
data

         fruit  Cost
fruit1   Apple    20
fruit2  Orange    30
fruit3  Banana    10
fruit4   Mango    25
fruit5  Grapes    25

thus we can change the index values according to our wish using the index parameter in DataFrame function

In [30]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,,25]
}

SyntaxError: invalid syntax (Temp/ipykernel_8300/3006845173.py, line 3)

leaving empty value like above is invalid

In [31]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,25]
}

In [32]:
data = pd.DataFrame(data)

ValueError: All arrays must be of the same length

Thus from above it is understood that when we are not aware of a data we cannot leave it empty

thus we use the value None

In [46]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,None,25]
}

In [47]:
data = pd.DataFrame(data)

In [48]:
data

    fruit  Cost
0   Apple  20.0
1  Orange  30.0
2  Banana  10.0
3   Mango   NaN
4  Grapes  25.0

To view or check if a table has null values or not :

In [49]:
data.isnull()

   fruit   Cost
0  False  False
1  False  False
2  False  False
3  False   True
4  False  False

thus all values that have true from above table is such that it has null or none value


To obtain the opposite of this values we use the function notnull

In [50]:
data.notnull()

   fruit   Cost
0   True   True
1   True   True
2   True   True
3   True  False
4   True   True

To locate a value or a row we use iloc[ ] and we use iloc[ ] to check anything for a particular value

In [51]:
data.notnull().iloc[3,1]

False

In [52]:
data.notnull().iloc[3]

fruit     True
Cost     False
Name: 3, dtype: bool

We can cleary see that when we had no null values in our column the entire column had integer values when the inout itself is an integer, since there is a null value we have to the integer has become a float

In [57]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20.0,30.23,10.23,38.392,25.232]
}

In [58]:
data = pd.DataFrame(data)

In [59]:
data

    fruit    Cost
0   Apple  20.000
1  Orange  30.230
2  Banana  10.230
3   Mango  38.392
4  Grapes  25.232

Thus from the above example not every column that has decimal value contains a none or null value

and the values that has hieghst decimal value length is eqaul to  the length of all values

In [63]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,25,25],
    'age':[10,10,10,20,15]
}

In [64]:
data = pd.DataFrame(data)

In [65]:
data

    fruit  Cost  age
0   Apple    20   10
1  Orange    30   10
2  Banana    10   10
3   Mango    25   20
4  Grapes    25   15

In [71]:
data.sort_values('Cost')

    fruit  Cost  age
2  Banana    10   10
0   Apple    20   10
3   Mango    25   20
4  Grapes    25   15
1  Orange    30   10

Thus above is sorted  based on a single condition

In [9]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,None,None],
    'age':[10,10,None,20,15]
}

In [10]:
data = pd.DataFrame(data)

In [11]:
data

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   NaN
3   Mango   NaN  20.0
4  Grapes   NaN  15.0

In [12]:
data.sort_values('Cost')

    fruit  Cost   age
2  Banana  10.0   NaN
0   Apple  20.0  10.0
1  Orange  30.0  10.0
3   Mango   NaN  20.0
4  Grapes   NaN  15.0

Thus from above the sorting based on a single colomn is possible allowing the none values to the end

In [13]:
data.sort_values('Cost').sort_values('age')

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
4  Grapes   NaN  15.0
3   Mango   NaN  20.0
2  Banana  10.0   NaN

Thus in the above code we took a pipelining functions 

First analysis of the sorting, now we take the rows and sort using Cost
once ordered using cost we use age to sort it again by keeping the sortedd cost untouched

DataFrame.sort_values(by, *, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)

In [14]:
data.sort_values('Cost').sort_values('age',ascending = 0) #ascending can have a number as value but it does not affect the vlaue expect 0

    fruit  Cost   age
3   Mango   NaN  20.0
4  Grapes   NaN  15.0
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   NaN

In [15]:
data.sort_values(['Cost','age'])

    fruit  Cost   age
2  Banana  10.0   NaN
0   Apple  20.0  10.0
1  Orange  30.0  10.0
4  Grapes   NaN  15.0
3   Mango   NaN  20.0

In [16]:
data.sort_values(by=['Cost','age'])

    fruit  Cost   age
2  Banana  10.0   NaN
0   Apple  20.0  10.0
1  Orange  30.0  10.0
4  Grapes   NaN  15.0
3   Mango   NaN  20.0

In [17]:
data.sort_values('Cost').sort_values('age',ascending = 6767) #ascending can have a number as value but it does not affect the vlaue expect 0

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
4  Grapes   NaN  15.0
3   Mango   NaN  20.0
2  Banana  10.0   NaN

Deleting the rows that have NaN,

we cannot remove only that elec=ment as we ahev already seen that the schema of table is to be fulled with NAN so we cannot fill Nan with Nan thus to delete the entire row we can use drop function

In [18]:
data.dropna()

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0

In [19]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,None,None],
    'age':[10,10,None,20,15]
}
data = pd.DataFrame(data)

In [30]:
data

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   NaN
3   Mango   NaN  20.0
4  Grapes   NaN  15.0

In [31]:
data.drop(columns = ['fruit'])

   Cost   age
0  20.0  10.0
1  30.0  10.0
2  10.0   NaN
3   NaN  20.0
4   NaN  15.0

In [32]:
data.drop(columns = ['fruit','age'])

   Cost
0  20.0
1  30.0
2  10.0
3   NaN
4   NaN

In [34]:
data.drop([0,1,4])

    fruit  Cost   age
2  Banana  10.0   NaN
3   Mango   NaN  20.0

In [29]:
data.dropna(axis=1)

    fruit
0   Apple
1  Orange
2  Banana
3   Mango
4  Grapes

Thus from the above we can see how to delate rows that have null and columns that have null values.

The drop operation is done using dataframe.drop()



DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')


labels
single label or list-like
Index or column labels to drop. A tuple will be used as a single label and not treated as a list-like.


axis
{0 or ‘index’, 1 or ‘columns’}, default 0
Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’).


index
single label or list-like
Alternative to specifying axis (labels, axis=0 is equivalent to index=labels).

columns
single label or list-like
Alternative to specifying axis (labels, axis=1 is equivalent to columns=labels).

level
int or level name, optional
For MultiIndex, level from which the labels will be removed.


inplace
bool, default False
If False, return a copy. Otherwise, do operation in place and return None.


errors
{‘ignore’, ‘raise’}, default ‘raise’
If ‘ignore’, suppress error and only existing labels are dropped.


Returns
:
DataFrame or None
Returns DataFrame or None DataFrame with the specified index or column labels removed or None if inplace=True.


Raises
:
KeyError
If any of the labels is not found in the selected axis.

In [35]:
data

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   NaN
3   Mango   NaN  20.0
4  Grapes   NaN  15.0

In [36]:
data.fillna(5)

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   5.0
3   Mango   5.0  20.0
4  Grapes   5.0  15.0

In [38]:
data #remains unaffected though it was filled hence to save all changes use inplce = True

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   NaN
3   Mango   NaN  20.0
4  Grapes   NaN  15.0

In [41]:
data.fillna(5,inplace=True) 
#not only for this to save the data we must use inplace = True or assign the new updated data to new data frame

In [40]:
data

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   5.0
3   Mango   5.0  20.0
4  Grapes   5.0  15.0

In [117]:
data = {
    'fruit':['Apple','Orange','Banana','Mango','Grapes'],
    'Cost':[20,30,10,None,None],
    'age':[10,10,None,20,15]
}
data = pd.DataFrame(data)

In [118]:
data

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   NaN
3   Mango   NaN  20.0
4  Grapes   NaN  15.0

In [119]:
data['Cost'].fillna(45,inplace=True)

In [120]:
data['Cost'].mode()

0    45.0
dtype: float64

In [121]:
data

    fruit  Cost   age
0   Apple  20.0  10.0
1  Orange  30.0  10.0
2  Banana  10.0   NaN
3   Mango  45.0  20.0
4  Grapes  45.0  15.0

In [122]:
data.insert(3, "DOB", ['31-12-2023', '21-09-2006', '9-04-1999','13-9-2013','12-12-2026' ]) 
#dd-mm-yyyy temporary data only hence need to be assigned

In [125]:
data['DOB'] = pd.to_datetime(data['DOB']) # yyyy - mm - dd

In [126]:
data

    fruit  Cost   age        DOB
0   Apple  20.0  10.0 2023-12-31
1  Orange  30.0  10.0 2006-09-21
2  Banana  10.0   NaN 1999-09-04
3   Mango  45.0  20.0 2013-09-13
4  Grapes  45.0  15.0 2026-12-12

In [134]:
data.drop(index = 2)

    fruit  Cost   age        DOB
0   Apple  20.0  10.0 2023-12-31
1  Orange  30.0  10.0 2006-09-21
3   Mango  45.0  20.0 2013-09-13
4  Grapes  45.0  15.0 2026-12-12

In [135]:
data.loc[2]

fruit                 Banana
Cost                    10.0
age                      NaN
DOB      1999-09-04 00:00:00
Name: 2, dtype: object

In [137]:
data.loc[2]['Cost']

10.0

In [142]:
print(data.duplicated())
print(data.duplicated(['Cost']))

0    False
1    False
2    False
3    False
4    False
dtype: bool
0    False
1    False
2    False
3    False
4     True
dtype: bool

In [140]:
data

    fruit  Cost   age        DOB
0   Apple  20.0  10.0 2023-12-31
1  Orange  30.0  10.0 2006-09-21
2  Banana  10.0   NaN 1999-09-04
3   Mango  45.0  20.0 2013-09-13
4  Grapes  45.0  15.0 2026-12-12

In [143]:
print(data.drop_duplicates(['Cost']))

    fruit  Cost   age        DOB
0   Apple  20.0  10.0 2023-12-31
1  Orange  30.0  10.0 2006-09-21
2  Banana  10.0   NaN 1999-09-04
3   Mango  45.0  20.0 2013-09-13

In [144]:
values = []
values.append(data.drop_duplicates(['Cost']))

In [145]:
values

[    fruit  Cost   age        DOB
 0   Apple  20.0  10.0 2023-12-31
 1  Orange  30.0  10.0 2006-09-21
 2  Banana  10.0   NaN 1999-09-04
 3   Mango  45.0  20.0 2013-09-13]

In [146]:
data.describe()

            Cost        age
count   5.000000   4.000000
mean   30.000000  13.750000
std    15.411035   4.787136
min    10.000000  10.000000
25%    20.000000  10.000000
50%    30.000000  12.500000
75%    45.000000  16.250000
max    45.000000  20.000000

In [147]:
data

    fruit  Cost   age        DOB
0   Apple  20.0  10.0 2023-12-31
1  Orange  30.0  10.0 2006-09-21
2  Banana  10.0   NaN 1999-09-04
3   Mango  45.0  20.0 2013-09-13
4  Grapes  45.0  15.0 2026-12-12

In [148]:
data['Number']=[12,23,45,67,86]

In [149]:
data

    fruit  Cost   age        DOB  Number
0   Apple  20.0  10.0 2023-12-31      12
1  Orange  30.0  10.0 2006-09-21      23
2  Banana  10.0   NaN 1999-09-04      45
3   Mango  45.0  20.0 2013-09-13      67
4  Grapes  45.0  15.0 2026-12-12      86

In [150]:
data['mark']=23

In [151]:
data

    fruit  Cost   age        DOB  Number  mark
0   Apple  20.0  10.0 2023-12-31      12    23
1  Orange  30.0  10.0 2006-09-21      23    23
2  Banana  10.0   NaN 1999-09-04      45    23
3   Mango  45.0  20.0 2013-09-13      67    23
4  Grapes  45.0  15.0 2026-12-12      86    23

To add a new row

In [157]:
additional = pd.DataFrame(
    {
        'fruit':'Pinapple',
        'Cost':23,
        'age':134,
        'DOB':'2023-34-09',
        'Number':23,
        'mark':25
    },
    index=[2]
)

In [161]:
data=pd.concat([additional,data])

In [162]:
data

      fruit  Cost    age                  DOB  Number  mark
2  Pinapple  23.0  134.0           2023-34-09      23    25
0     Apple  20.0   10.0  2023-12-31 00:00:00      12    23
1    Orange  30.0   10.0  2006-09-21 00:00:00      23    23
2    Banana  10.0    NaN  1999-09-04 00:00:00      45    23
3     Mango  45.0   20.0  2013-09-13 00:00:00      67    23
4    Grapes  45.0   15.0  2026-12-12 00:00:00      86    23

In [164]:
data.assign(mark=['Delhi', 'Bangalore', 'Chennai', 'Patna',None,None])

      fruit  Cost    age                  DOB  Number       mark
2  Pinapple  23.0  134.0           2023-34-09      23      Delhi
0     Apple  20.0   10.0  2023-12-31 00:00:00      12  Bangalore
1    Orange  30.0   10.0  2006-09-21 00:00:00      23    Chennai
2    Banana  10.0    NaN  1999-09-04 00:00:00      45      Patna
3     Mango  45.0   20.0  2013-09-13 00:00:00      67       None
4    Grapes  45.0   15.0  2026-12-12 00:00:00      86       None

Slicing in pandas

In [165]:
data[2:3]

    fruit  Cost   age                  DOB  Number  mark
1  Orange  30.0  10.0  2006-09-21 00:00:00      23    23

In [167]:
data[:7]

      fruit  Cost    age                  DOB  Number  mark
2  Pinapple  23.0  134.0           2023-34-09      23    25
0     Apple  20.0   10.0  2023-12-31 00:00:00      12    23
1    Orange  30.0   10.0  2006-09-21 00:00:00      23    23
2    Banana  10.0    NaN  1999-09-04 00:00:00      45    23
3     Mango  45.0   20.0  2013-09-13 00:00:00      67    23
4    Grapes  45.0   15.0  2026-12-12 00:00:00      86    23

In [168]:
data[:7:2]

      fruit  Cost    age                  DOB  Number  mark
2  Pinapple  23.0  134.0           2023-34-09      23    25
1    Orange  30.0   10.0  2006-09-21 00:00:00      23    23
3     Mango  45.0   20.0  2013-09-13 00:00:00      67    23

In [170]:
data=data.assign(index=[0,1,2,3,4,5])

In [171]:
data

      fruit  Cost    age                  DOB  Number  mark  index
2  Pinapple  23.0  134.0           2023-34-09      23    25      0
0     Apple  20.0   10.0  2023-12-31 00:00:00      12    23      1
1    Orange  30.0   10.0  2006-09-21 00:00:00      23    23      2
2    Banana  10.0    NaN  1999-09-04 00:00:00      45    23      3
3     Mango  45.0   20.0  2013-09-13 00:00:00      67    23      4
4    Grapes  45.0   15.0  2026-12-12 00:00:00      86    23      5

In [172]:
data.reset_index()

   level_0     fruit  Cost    age                  DOB  Number  mark  index
0        2  Pinapple  23.0  134.0           2023-34-09      23    25      0
1        0     Apple  20.0   10.0  2023-12-31 00:00:00      12    23      1
2        1    Orange  30.0   10.0  2006-09-21 00:00:00      23    23      2
3        2    Banana  10.0    NaN  1999-09-04 00:00:00      45    23      3
4        3     Mango  45.0   20.0  2013-09-13 00:00:00      67    23      4
5        4    Grapes  45.0   15.0  2026-12-12 00:00:00      86    23      5

In [175]:
data.drop('index',axis=1)

      fruit  Cost    age                  DOB  Number  mark
2  Pinapple  23.0  134.0           2023-34-09      23    25
0     Apple  20.0   10.0  2023-12-31 00:00:00      12    23
1    Orange  30.0   10.0  2006-09-21 00:00:00      23    23
2    Banana  10.0    NaN  1999-09-04 00:00:00      45    23
3     Mango  45.0   20.0  2013-09-13 00:00:00      67    23
4    Grapes  45.0   15.0  2026-12-12 00:00:00      86    23